---
type: RelinquishOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# RelinquishOptions

`Autodesk.Revit.DB.RelinquishOptions` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RelinquishOptions | 2014 | `public RelinquishOptions ( bool relinquishEverything )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | CheckedOutElements | 2014 | `public bool CheckedOutElements { get ; set ; }` |
| Property | FamilyWorksets | 2014 | `public bool FamilyWorksets { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | StandardWorksets | 2014 | `public bool StandardWorksets { get ; set ; }` |
| Property | UserWorksets | 2014 | `public bool UserWorksets { get ; set ; }` |
| Property | ViewWorksets | 2014 | `public bool ViewWorksets { get ; set ; }` |